<?php

namespace Database\Seeders;

use App\Models\Equipment;
use App\Models\Proficiency;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class EquipmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $equipmentData = [
            // Оружие (простое)
            ['name' => 'Боевой посох', 'type' => 'Простое оружие'],
            ['name' => 'Булава', 'type' => 'Простое оружие'],
            ['name' => 'Дубинка', 'type' => 'Простое оружие'],
            ['name' => 'Кинжал', 'type' => 'Простое оружие'],
            ['name' => 'Копье', 'type' => 'Простое оружие'],
            ['name' => 'Лёгкий молот', 'type' => 'Простое оружие'],
            ['name' => 'Метательное копьё', 'type' => 'Простое оружие'],
            ['name' => 'Палица', 'type' => 'Простое оружие'],
            ['name' => 'Ручной топор', 'type' => 'Простое оружие'],
            ['name' => 'Серп', 'type' => 'Простое оружие'],
            ['name' => 'Лёгкий арбалет', 'type' => 'Простое оружие'],
            ['name' => 'Короткий лук', 'type' => 'Простое оружие'],
            ['name' => 'Праща', 'type' => 'Простое оружие'],

            // Оружие (Воинское)
            ['name' => 'Алебарда', 'type' => 'Воинское оружие'],
            ['name' => 'Боевая кирка', 'type' => 'Воинское оружие'],
            ['name' => 'Боевой молот', 'type' => 'Воинское оружие'],
            ['name' => 'Боевой топор', 'type' => 'Воинское оружие'],
            ['name' => 'Глефа', 'type' => 'Воинское оружие'],
            ['name' => 'Двуручный меч', 'type' => 'Воинское оружие'],
            ['name' => 'Длинное копьё', 'type' => 'Воинское оружие'],
            ['name' => 'Длинный меч', 'type' => 'Воинское оружие'],
            ['name' => 'Кнут', 'type' => 'Воинское оружие'],
            ['name' => 'Короткий меч', 'type' => 'Воинское оружие'],
            ['name' => 'Молот', 'type' => 'Воинское оружие'],
            ['name' => 'Моргенштерн', 'type' => 'Воинское оружие'],
            ['name' => 'Пика', 'type' => 'Воинское оружие'],
            ['name' => 'Рапира', 'type' => 'Воинское оружие'],
            ['name' => 'Секира', 'type' => 'Воинское оружие'],
            ['name' => 'Скимитар', 'type' => 'Воинское оружие'],
            ['name' => 'Трезубец', 'type' => 'Воинское оружие'],
            ['name' => 'Ручной арбалет', 'type' => 'Воинское оружие'],
            ['name' => 'Тяжёлый арбалет', 'type' => 'Воинское оружие'],
            ['name' => 'Длинный лук', 'type' => 'Воинское оружие'],
            ['name' => 'Духовая трубка', 'type' => 'Воинское оружие'],
            ['name' => 'Сеть', 'type' => 'Воинское оружие'],

            // Доспехи (лёгкие/средние/тяжёлые)
            ['name' => 'Стёганый доспех', 'type' => 'Лёгкие доспехи'],
            ['name' => 'Кожаный доспех', 'type' => 'Лёгкие доспехи'],
            ['name' => 'Проклёпанный кожаный доспех', 'type' => 'Лёгкие доспехи'],
            ['name' => 'Шкурный', 'type' => 'Средние доспехи'],
            ['name' => 'Кольчужная рубаха', 'type' => 'Средние доспехи'],
            ['name' => 'Чешуйчатый', 'type' => 'Средние доспехи'],
            ['name' => 'Кираса', 'type' => 'Средние доспехи'],
            ['name' => 'Полулаты', 'type' => 'Средние доспехи'],
            ['name' => 'Колечный', 'type' => 'Тяжёлые доспехи'],
            ['name' => 'Кольчуга', 'type' => 'Тяжёлые доспехи'],
            ['name' => 'Наборный', 'type' => 'Тяжёлые доспехи'],
            ['name' => 'Латы', 'type' => 'Тяжёлые доспехи'],
            ['name' => 'Щит', 'type' => 'Щиты'],

            // Снаряжение
            ['name' => 'Набор артиста'],
            ['name' => 'Набор дипломата'],
            ['name' => 'Рюкзак'],
            ['name' => 'Походное снаряжение'],
            ['name' => 'Набор путешественника'],
            ['name' => 'Мешок с инструментами'],
            ['name' => 'Воровские инструменты'],
            ['name' => 'Набор для грима'],
            ['name' => 'Зелье лечения'],
            ['name' => 'Священный символ'],
            ['name' => 'Магический фокус'],
            ['name' => 'Дротики', 'type' => 'Простое оружие'],

            // Прочее
            ['name' => 'Веревка'],
            ['name' => 'Факелы'],
            ['name' => 'Трут и огниво'],
            ['name' => 'Котелок'],
            ['name' => 'Чернила и перо'],
            ['name' => 'Бумага'],
            ['name' => 'Фляга с водой'],
            ['name' => 'Паек'],
            ['name' => 'Лопатка'],
            ['name' => 'Молоток и колья'],

            // Магические классы
            ['name' => 'Книга заклинаний'],
            ['name' => 'Компонентная сумка'],
            ['name' => 'Друидский фокус'],

            // Ремесленники
            ['name' => 'Кузнечные инструменты'],
            ['name' => 'Алхимический набор'],
            ['name' => 'Набор травника'],

            // Музыканты
            ['name' => 'Лютня', 'type' => 'Музыкальные инструменты'],
            ['name' => 'Флейта', 'type' => 'Музыкальные инструменты'],
            ['name' => 'Барабан', 'type' => 'Музыкальные инструменты'],
        ];

        foreach ($equipmentData as $item) {
            // Создаем тип владения (например, "Простое оружие")
            $typeProficiency = null;
            if(isset($item['type'])) {
                $typeProficiency = Proficiency::firstOrCreate(['name' => $item['type']])->id;
            }

            // Создаем владение конкретным предметом (например, "Короткий меч")
            $itemProficiency = Proficiency::firstOrCreate(['name' => $item['name']]);

            // Создаем оборудование
            Equipment::create([
                'type_id' => $typeProficiency,
                'proficiency_id' => $itemProficiency->id,
                'name' => $item['name']
            ]);
        }
    }
}
