<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class LvlController extends Controller
{
    public function info()
    {
        return response()->json([
            1 => [0, 299], // Уровень 1
            2 => [300, 899], // Уровень 2
            3 => [900, 2699], // Уровень 3
            4 => [2700, 6499], // Уровень 4
            5 => [6500, 13999], // Уровень 5
            6 => [14000, 22999], // Уровень 6
            7 => [23000, 33999], // Уровень 7
            8 => [34000, 47999], // Уровень 8
            9 => [48000, 63999], // Уровень 9
            10 => [64000, 84999], // Уровень 10
            11 => [85000, 99999], // Уровень 11
            12 => [100000, 119999], // Уровень 12
            13 => [120000, 139999], // Уровень 13
            14 => [140000, 164999], // Уровень 14
            15 => [165000, 194999], // Уровень 15
            16 => [195000, 224999], // Уровень 16
            17 => [225000, 264999], // Уровень 17
            18 => [265000, 304999], // Уровень 18
            19 => [305000, 354999], // Уровень 19
            20 => [355000, 355000], // Уровень 20
        ]);
    }
}
